import styles from './agreement.module.scss';

const Agreement: React.FC = () => {
	return (
		<>
			<section className={styles.agreement}>
				<div className={styles.agreement_box}>
					<h1 className={styles.agreement_title}>
						Политика обработки и хранения персональных данных
					</h1>
					<h3 className={styles.agreement_subtitle}>1. Общие положения</h3>
					<p className={`${styles['text-x']}`}>
						1.1 Настоящая Политика обработки персональных данных (далее – «Политика»)
						разработана и применяется обществом с ограниченной ответственностью «ГудФуд»,
						ОГРН номер (далее - «Оператор») в соответствии с Федеральным законом от
						27.07.2006 г. № 152-ФЗ «О персональных данных».
					</p>
					<p className={`${styles['text-x']}`}>
						1.2 Основные термины, используемые в настоящей Политике в соответствии с
						положениями Федерального закона от 27.07.2006 г. № 152-ФЗ «О персональных
						данных»:
					</p>
					<p className={`${styles['text-x']}`}>
						а) персональные данные – любая информация, относящаяся прямо или косвенно к
						определенному или определяемому физическому лицу (субъекту персональных
						данных, субъекту);
					</p>
					<p className={`${styles['text-x']}`}>
						б) оператор персональных данных (оператор) – юридическое лицо самостоятельно
						или совместно с другими лицами организующие и (или) осуществляющие обработку
						персональных данных, а также определяющие цели обработки персональных данных,
						состав персональных данных, подлежащих обработке, действия (операции),
						совершаемые с персональными данными;
					</p>
					<p className={`${styles['text-x']}`}>
						в) обработка персональных данных – любое действие (операция) или совокупность
						действий (операций) с персональными данными, совершаемых с использованием
						средств автоматизации или без их использования;
					</p>
					<p className={`${styles['text-x']}`}>
						г) автоматизированная обработка персональных данных – обработка персональных
						данных с помощью средств вычислительной техники;
					</p>
					<p className={`${styles['text-x']}`}>
						д) предоставление персональных данных – действия, направленные на раскрытие
						персональных данных определенному лицу или определенному кругу лиц;
					</p>
					<p className={`${styles['text-x']}`}>
						е) блокирование персональных данных – временное прекращение обработки
						персональных данных (за исключением случаев, если обработка необходима для
						уточнения персональных данных);
					</p>
					<p className={`${styles['text-x']}`}>
						ж) уничтожение персональных данных – действия, в результате которых становится
						невозможным восстановить содержание персональных данных в информационной
						системе персональных данных и (или) в результате которых уничтожаются
						материальные носители персональных данных;
					</p>
					<p className={`${styles['text-x']}`}>
						з) обезличивание персональных данных – действия, в результате которых
						становится невозможным без использования дополнительной информации определить
						принадлежность персональных данных конкретному субъекту персональных данных;
					</p>
					<p className={`${styles['text-x']}`}>
						и) информационная система персональных данных – совокупность содержащихся в
						базах данных персональных данных и обеспечивающих их обработку информационных
						технологий и технических средств.
					</p>
					<p className={`${styles['text-x']}`}>
						1.3 Настоящая Политика применяется в отношении всех персональных данных,
						которые могут быть получены от Субъекта персональных данных Оператором
						посредством регистрации, авторизации, оформления заказа Субъектом персональных
						данных посредством сайта https://goodfood.acceleratorpracticum.ru/ (далее –
						«Сайт») и/или мобильного приложения Оператора (далее - «Приложение»). Далее по
						тексту «Сайт» и «Приложение» при совместном упоминание именуются «Сервис».
					</p>
					<p className={`${styles['text-x']}`}>
						1.4 Настоящая Политика применяется в отношении всех персональных данных,
						которые могут быть получены от Субъекта персональных данных - лица, не
						являющегося штатными или внештатным сотрудником организации, Оператором
						посредством регистрации, авторизации, оформления заказа Субъектом персональных
						данных посредством сайта https://goodfood.acceleratorpracticum.ru/ (далее –
						«Сайт») и/или мобильного приложения Оператора (далее - «Приложение»). Далее по
						тексту «Сайт» и «Приложение» при совместном упоминание именуются «Сервис».
					</p>
					<p className={`${styles['text-x']}`}>...</p>
					<p className={`${styles['text-x']}`}></p>
					<p className={`${styles['text-x']}`}></p>
					<p className={`${styles['text-x']}`}></p>
				</div>
			</section>
		</>
	);
};

export default Agreement;
