import styles from './delivery-conditions.module.scss';

const DeliveryConditions: React.FC = () => {
	return (
		<>
			<section className={styles.agreement}>
				<div className={styles.agreement_box}>
					<h1 className={styles.agreement_title}>
						Пользовательское соглашение об условиях доставки
					</h1>
					<h3 className={styles.agreement_subtitle}>Термины и определения</h3>
					<p className={`${styles['text-x']}`}>
						В настоящем соглашении, если из контекста не следует иное, нижеприведенные
						термины имеют следующие значения и являются её составной неотъемлемой частью:
						«Соглашение» - настоящий документ, размещенный в сети Интернет по адресу:{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/">
							https://goodfood.acceleratorpracticum.ru/
						</a>
						, являющееся открытым и общедоступным документом.
					</p>
					<p className={`${styles['text-x']}`}>
						Действующая редакция Соглашения располагается в сети Интернет по адресу:{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/delivery-conditions">
							https://goodfood.acceleratorpracticum.ru/delivery-conditions
						</a>
					</p>
					<p className={`${styles['text-x']}`}>
						«Пользователь» - любое физическое лицо, надлежащим образом присоединившееся к
						настоящему Соглашению для использования сайта/приложения Компании и/или
						оформления Заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						«Компания» - Общество с ограниченной ответственностью «ГудФуд» (ОГРН номер,
						ИНН номер), оказывающая услуги Пользователю по осуществлению Заказа Товара и
						Доставки на условиях, предусмотренных в Пользовательском соглашении
						посредством Сайта:{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/">
							https://goodfood.acceleratorpracticum.ru/
						</a>{' '}
						(далее – Сайт) и/или мобильного приложения.
					</p>
					<p className={`${styles['text-x']}`}>
						«Исполнитель» - юридическое лицо или индивидуальный предприниматель,
						осуществляющее(ий) приготовление/реализацию Товара для Пользователя.
					</p>
					<p className={`${styles['text-x']}`}>
						«Доставщик» - лица, осуществляющие доставку Товара, Заказ которого оформлен
						Пользователем (за исключением случая осуществления доставки Товара Компанией
						Исполнителем).
					</p>
					<p className={`${styles['text-x']}`}>
						«Товар» - пищевая продукция и напитки (за исключением алкогольных),
						приготовление которых для Пользователей осуществляет Исполнитель в результате
						оформления Пользователем Заказа на Сайте и/или Приложении Компании. При
						упоминании в настоящем соглашении или иных документах Товара, имеется в виду
						как один Товар, так и несколько Товаров, если иное не следует из соглашения
						или соответствующего документа.
					</p>
					<p className={`${styles['text-x']}`}>
						«Приложение» - мобильное приложение Компании, разработанное для удобства
						Пользователя с целью выбора Товара и оформления Заказа, размещенного на Сайте.
					</p>
					<p className={`${styles['text-x']}`}>
						«Сайт» - официальная веб-страница Компании, расположенная по адресу:{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/">
							https://goodfood.acceleratorpracticum.ru/
						</a>{' '}
						посредством которой Пользователь получает информацию о Товаре и оформляет
						Заказ.
					</p>
					<p className={`${styles['text-x']}`}>
						«Сервис» - Сайт и мобильное приложение Компании.
					</p>
					<p className={`${styles['text-x']}`}>
						«Регистрация» - процедура внесения Пользователем своих Персональных данных в
						определённую электронную форму на Сервисе с целью получения доступа к услугам
						в соответствии с положениями настоящего Соглашения. Регистрация может быть
						совершена Пользователем как отдельно, так и совместно с созданием Заказа на
						Сервисе.
					</p>
					<p className={`${styles['text-x']}`}>
						«Заказ» - оформленный Пользователем на Сервисе Заказ Товара и его Доставки, в
						результате которого Пользователь заключает договор о приготовлении Товара с
						Исполнителем, и договор доставки данного Товара на условиях, размещенных на
						Сервисе.
					</p>
					<p className={`${styles['text-x']}`}>
						«Договор» - договор о приготовлении/ реализации Товара и/или его доставки,
						заключаемый между Пользователем и Исполнителем в результате оформления Заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						«Доставка» - услуга доставки Товара до адреса, указанного Пользователем, Заказ
						которого Пользователь оформил на Сайте или в Приложении,. Заключение с
						Пользователем договора о доставке осуществляет Доставщик, либо,
						непосредственно Исполнитель посредством оформления Пользователем Заказа на
						сервисе. Исполнитель или Доставщик имеют право привлекать третьих лиц для
						осуществления доставки Товара до Пользователя.
					</p>
					<p className={`${styles['text-x']}`}>
						«Промокод» - определенная последовательность символов, при условии активации
						которой и соблюдении иных условий использования Промокода Пользователю
						предоставляется скидка на стоимость Товара и/или Доставки.
					</p>
					<p className={`${styles['text-x']}`}>
						«Персональные данные» – личная информация (включая фамилию, имя, отчество,
						дату рождения, почтовый адрес, контактный телефон и адрес электронной почты, а
						также другую информацию, которую Пользователь сообщает, используя Сервис),
						данную информацию Пользователь предоставляет осознанно и добровольно в момент
						Регистрации на Сервисе и/или оформления Заказа на Сервисе в соответствии с
						положениями настоящего Соглашения и Политики хранения и обработки персональных
						данных.
					</p>
					<p className={`${styles['text-x']}`}>
						«Пользовательское соглашение» — настоящий документ, размещенный в сети
						Интернет по адресу:{' '}
						<span className={`${styles['text-xl']}`}>
							ссылка на страницу с данным соглашением
						</span>
					</p>
					<p className={`${styles['text-x']}`}>
						«Политика обработки и хранения персональных данных» - документ, определяющий
						порядок и условия осуществления обработки персональных данных Пользователей,
						размещенный в сети Интернет по адресу:{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/agreement">
							https://goodfood.acceleratorpracticum.ru/
						</a>
					</p>
					<h3 className={styles.agreement_subtitle}>
						1. Общие положения. Предмет соглашения
					</h3>
					<p className={`${styles['text-x']}`}>
						1.1. Перед тем как начать использовать Сервис Пользователь обязан ознакомиться
						с настоящим Соглашением и присоединиться к нему. Пользователь подтверждает,
						что прочитал, понял и полностью согласен соблюдать настоящее Соглашение.
					</p>
					<p className={`${styles['text-x']}`}>
						Обращаем Ваше внимание, что родители несут полную ответственность за жизнь и
						здоровье своих детей (согласно ст.63, 65 Семейного кодекса РФ, ст.5.35. КоАП
						РФ.). Употребление содержащихся в составе блюд морепродуктов, морской капусты,
						а также имбиря и вассаби должно соответствовать определенному этапу
						формирования детского организма, с учетом возможных аллергических реакций.
						Рекомендуем до 7-8 летнего возраста приобретать для детей блюда из раздела
						"Детское меню".
					</p>
					<p className={`${styles['text-x']}`}>
						1.2. Сервис предлагает Пользователю доступ к поиску и Заказу готовой еды на
						условиях, предусмотренных настоящим Соглашением. В соответствии с настоящим
						соглашением Пользователь при оформлении Заказа заключает Договор с Компанией,
						в связи с чем возникают прямые договорные отношения с Исполнителем в части
						приготовления и/или реализации Товара и осуществления Доставки.
					</p>
					<p className={`${styles['text-x']}`}>
						1.3. В соответствии со статьей 437 Гражданского Кодекса Российской Федерации
						(далее по тексту соглашения - ГК РФ) настоящее соглашение является публичной
						офертой, адресованной физическим лицам, и в случае принятия изложенных условий
						в настоящем соглашении, физическое лицо обязуется произвести оплату Товара на
						условиях, изложенных в настоящем соглашении.
					</p>
					<p className={`${styles['text-x']}`}>
						В соответствии с пунктом 3 статьи 438 ГК РФ, момент окончательного
						подтверждения Заказа Пользователем является акцептом оферты, что является
						равносильным заключению Договора розничной купли-продажи Товара на условиях,
						установленных в настоящем соглашении и на Сервисе.
					</p>
					<p className={`${styles['text-x']}`}>
						1.3.1. Компания или Исполнитель вправе отказаться от заключения публичного
						договора при отсутствии технической (поломки оборудования, в том числе при
						принятии/подтверждении заказа), физической (удаленность Потребителя от
						территории оказания услуг) и иной возможности предоставить потребителю товары,
						услуги надлежащего качества.
					</p>
					<p className={`${styles['text-x']}`}>
						1.4. Принимая условия настоящего Соглашения, Пользователь подтверждает свое
						информированное и добровольное согласие на обработку его персональных данных,
						предоставленных при регистрации, в том числе, но не ограничиваясь: для ответа
						на обращения Пользователя в службу технической поддержки Сервиса, для
						разрешения возможных претензий, для участия в стимулирующих, рекламных,
						маркетинговых и иных мероприятиях, направленных на продвижение услуг Компании,
						партнеров Исполнителя и иных третьих лиц. Компания вправе направлять
						Пользователю информацию о функционировании Сервиса на адрес электронной почты,
						на номер телефона, указанные Пользователем, а также направлять собственные или
						принадлежащие Компании информационные, рекламные или иные сообщения, или
						размещать соответствующую информацию в самом сервисе. Также Пользователь
						подтверждает свое согласие на передачу указанных выше персональных данных
						Компании и их обработку Компанией в целях исполнения настоящего Соглашения и
						реализации функционирования Сервиса, а также разрешения претензий, связанных с
						исполнением настоящего Соглашения.
					</p>
					<p className={`${styles['text-x']}`}>
						Принимая условия настоящего Соглашения, Пользователь в том числе принимает
						условия Политики хранения и обработки персональных данных.
					</p>
					<p className={`${styles['text-x']}`}>
						1.5. Настоящее соглашение может быть изменено Компанией в одностороннем
						порядке. Уведомление пользователей, при внесении изменений в Соглашение,
						происходит путем размещения новой редакции Соглашения по постоянному адресу{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/delivery-conditions">
							https://goodfood.acceleratorpracticum.ru/delivery-conditions
						</a>{' '}
						не позднее, чем за 10 дней до вступления в силу соответствующих изменений.
						Предыдущие редакции Соглашения хранятся в архиве документации Компании
						Заказчика. При этом продолжение использования сервиса после внесения изменений
						и/или дополнений в настоящее Соглашение, означает согласие Пользователя с
						такими изменениями и/или дополнениями, в связи с чем Пользователь обязуется
						регулярно отслеживать изменения в соответствующем разделе и в Соглашении,
						размещенном на сайте{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/delivery-conditions">
							https://goodfood.acceleratorpracticum.ru/delivery-conditions
						</a>{' '}
						Пользователь вправе отказаться от принятия изменений Соглашения, что означает
						отказ Пользователя от использования сервиса.
					</p>
					<h3 className={styles.agreement_subtitle}>
						2. Права и обязанности Пользователя
					</h3>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						2.1. Пользователь обязуется надлежащим образом соблюдать условия настоящего
						Соглашения.
					</p>
					<p className={`${styles['text-x']}`}>
						2.2. При заказе посредством Сервиса Пользователь обязуется сообщать
						достоверную информацию о себе для надлежащего исполнения обязательств,
						предусмотренных настоящим соглашением.
					</p>
					<p className={`${styles['text-x']}`}>
						2.3. Пользователь обязуется принимать надлежащие меры для обеспечения
						сохранности его мобильного устройства и несет личную ответственность за
						сохранность личных данных, указанных на сервисе, за безопасность своего логина
						и пароля.
					</p>
					<p className={`${styles['text-x']}`}>
						2.4. Пользователь обязуется не использовать сервис для любых иных целей, кроме
						как для целей, связанных с личным некоммерческим использованием.
					</p>
					<p className={`${styles['text-x']}`}>
						2.5. Пользователь обязуется, пользуясь сервисом, не вводить в заблуждение
						других Пользователей и третьих лиц.
					</p>
					<p className={`${styles['text-x']}`}>
						2.6. Пользователь обязуется не использовать стороннее программное обеспечение
						и другие технические средства, влияющие на работу сервиса и связанную с ней
						систему.
					</p>
					<h3 className={styles.agreement_subtitle}>3. Права и обязанности Компании</h3>
					<p className={`${styles['text-x']}`}>
						3.1. Компания вправе заблокировать доступ Пользователя к Сервису в случае
						обнаружения нарушений Пользователем обязанностей, указанных в разделе 2
						настоящего Соглашения.
					</p>
					<p className={`${styles['text-x']}`}>
						3.2. Компания оставляет за собой право в любой момент расторгнуть настоящее
						Соглашение по организационным или техническим причинам в одностороннем
						порядке, заблокировав возможность его использования.
					</p>
					<p className={`${styles['text-x']}`}>
						3.3. Компания осуществляет обработку персональных данных пользователя в целях
						исполнения и на условиях настоящего Соглашения.
					</p>
					<h3 className={styles.agreement_subtitle}>4. Оплата Товара и/или Доставки</h3>
					<p className={`${styles['text-x']}`}>
						4.1. Оплата Товара и/или Доставки в рамках оформленного Пользователем Заказа,
						может быть произведена Пользователем:
					</p>
					<p className={`${styles['text-x']}`}>
						4.1.1. Непосредственно Исполнителю наличными денежными средствами или
						посредством банковской карты через терминал оплаты в момент доставки Товара.
						Указанный вид оплаты осуществляется без участия Компании и не регулируется
						положениям настоящего Соглашения.
					</p>
					<p className={`${styles['text-x']}`}>
						4.1.2. Пользователю может быть доступна функция оплаты Доставщику (либо
						третьему лицу, привлекаемому Доставщиком, в случае, если Доставщик привлекает
						такое третье лицо для осуществления Доставки Товара до Пользователя) наличными
						денежными средствами в случае осуществления Доставки Товара Доставщиком. В
						этом случае Доставщик (либо привлекаемое им третье лицо) в части приема
						денежных средств за Товар действует по поручению Исполнителя.
					</p>
					<p className={`${styles['text-x']}`}>
						4.1.3. Пользователю может быть доступна функция безналичной оплаты в
						интерфейсе Сервиса с Привязанной банковской карты (п. 4.3. настоящего
						соглашения). В этом случае оплата происходит через авторизационный сервер
						Процессингового центра Банка с использованием Банковских кредитных карт
						следующих платежных систем: МИР VISA InternationalMasterCard World Wide К
						оплате принимаются все виды платежных карточек VISA, за исключением Visa
						Electron. В большинстве случаев карта Visa Electron не применима для оплаты
						через интернет, за исключением карт, выпущенных отдельными банками. О
						возможность оплаты картой Visa Electron вам нужно выяснять у банка-эмитента
						вашей карты.
					</p>
					<p className={`${styles['text-x']}`}>
						Доставщика с привлечением уполномоченного оператора по приему платежей или
						оператора электронных денежных средств и является получателем платежа в
						качестве агента Исполнителя и/или Доставщика (далее – «безналичная оплата»).
						Компания не гарантирует отсутствие ошибок и сбоев в работе сервиса в отношении
						предоставления возможности безналичной оплаты. Компания вправе
					</p>
					<p className={`${styles['text-x']}`}>
						4.1.3.2. Для оплаты Заказа Покупатель перенаправляется на платежный шлюз Банка
						для ввода реквизитов карты. Соединение с платежным шлюзом и передача
						информации осуществляется в защищенном режиме с использованием протокола
						шифрования SSL.
					</p>
					<p className={`${styles['text-x']}`}>
						В случае если банк Покупателя поддерживает технологию безопасного проведения
						интернет-платежей Verified By Visa или MasterCard Secure Code для проведения
						платежа также может потребоваться ввод специального пароля. Проведение
						платежей по банковским картам осуществляется в строгом соответствии с
						требованиями платежных систем Visa Int. и MasterCard Europe Sprl. Введенная
						информация не будет предоставлена третьим лицам за исключением случаев,
						предусмотренных законодательством РФ.
					</p>
					<p className={`${styles['text-x']}`}>
						Способы и возможность получения паролей для совершения интернет-платежей
						Пользователь может уточнить в банке, выпустившем карту.
					</p>
					<p className={`${styles['text-x']}`}>
						4.1.4. Компания не гарантирует отсутствие ошибок и сбоев в работе Сервиса в
						отношении предоставления возможности оплаты наличными или безналичными
						денежными средствами. Выбор соответствующей формы оплаты производится
						Пользователем в интерфейсе Сервиса. При этом, доступный Пользователю в
						конкретный момент времени способ оплаты Товара и/или Доставки определяется с
						учетом технических, временных, материальных и/или иных факторов.
					</p>
					<p className={`${styles['text-x']}`}>
						4.2. Прием денежных средств Компанией в случае, предусмотренном п. 4.1.3.
						настоящего соглашения, осуществляется исключительно в связи с тем, что
						Компания посредством предоставления возможности оформления Заказа на сервисе
						участвует в реализации Исполнителем Пользователю Товаров, в оплату которых
						принимаются денежные средства. При этом прием денежных средств, в случае,
						предусмотренном п. 4.1.2. настоящего соглашения, осуществляется Доставщиком,
						привлекаемым Исполнителем (либо третьим лицом, привлекаемым Доставщиком), в
						связи с доставкой Товара Пользователю.Компания и Доставщик не являются
						платежными агентами при проведении расчетов в соответствии с настоящим
						соглашением согласно пп. 1, 4 ч. 2 ст. 1 Федерального закона от 03.06.2009 №
						103-ФЗ «О деятельности по приему платежей физических лиц, осуществляемой
						платежными агентами».
					</p>
					<p className={`${styles['text-x']}`}>
						4.3. Привязанная банковская карта может указываться Пользователем в интерфейсе
						сервиса, при этом Пользователь указывает следующие данные:
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						- Hаименование владельца банковской карты;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						- номер банковской карты;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						- срок окончания действия банковской карты, месяц/год;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						- CVV код для карт Visa / CVC код для Master Card.
					</p>
					<p className={`${styles['text-x']}`}>
						Если на банковской карте код CVC / CVV отсутствует, то, возможно, карта не
						пригодна для CNP транзакций (т.е. таких транзакций, при которых сама карта не
						присутствует, а используются её реквизиты), и в данном случае следует
						обратиться в банк для получения подробной информации.
					</p>
					<p className={`${styles['text-x']}`}>
						Если данные банковской карты верны, действительны и использование данной карты
						в рамках сервиса технически возможно, указанная банковская карта приобретает
						статус Привязанной и может быть использована для безналичной оплаты. Все
						Привязанные карты отображаются в интерфейсе сервиса.
					</p>
					<p className={`${styles['text-x']}`}>
						4.4. Безналичная оплата осуществляется Пользователем с участием
						уполномоченного оператора по приему платежей или оператора электронных
						денежных средств и регулируется правилами международных платежных систем,
						банков (в том числе банка-эмитента Привязанной карты) и других участников
						расчетов.
					</p>
					<p className={`${styles['text-x']}`}>
						4.5. При указании своих данных согласно п. 4.3. настоящего соглашения и
						дальнейшем использовании Привязанной карты Пользователь подтверждает и
						гарантирует указание им достоверной и полной информации о действительной
						банковской карте, выданной на его имя, соблюдение им правил международных
						платежных систем и требований банка-эмитента, выпустившего Привязанную карту,
						в том числе в отношении порядка проведения безналичных расчетов.
					</p>
					<p className={`${styles['text-x']}`}>
						4.6. Пользователь понимает и соглашается, что все действия, совершенные в
						рамках сервиса после авторизации с помощью логина и пароля, присвоенных ему
						при регистрации на Сервисе, в том числе по безналичной оплате с использованием
						Привязанной банковской карты, считаются совершенными Пользователем.
					</p>
					<p className={`${styles['text-x']}`}>
						4.7. В случае несогласия Пользователя с фактом и/или суммой безналичной
						оплаты, а также получения некачественного, некомплектного Товара, либо
						несоответствия полученного Товара заказанному, Пользователь вправе обратиться
						к Компании по реквизитам, указанным в настоящем соглашении, в течение 2
						календарных дней с указанием событий, послуживших причиной обращения.
					</p>
					<p className={`${styles['text-x']}`}>
						При получении Товара Пользователь проверяет его соответствие Заказу,
						комплектность и отсутствие претензий к внешнему виду доставленного Товара. В
						случае выявления несоответствий Пользователь вправе потребовать замены на
						Товары надлежащего качества сразу в момент получения, уведомив об этом
						Доставщика, либо в течение 5 минут после получения Товара, уведомив об этом
						Компанию; либо потребовать произвести возврат Пользователю ранее оплаченных
						денежных средств за данный Товар из Заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						Возврат денежных средств Пользователю производится на банковскую карту
						Пользователя в течение 5 (Пяти) банковских дней, начиная со следующего
						банковского дня с момента выставления законного и обоснованного требования о
						возврате денежных средств.
					</p>
					<p className={`${styles['text-x']}`}>
						Компания/Исполнитель вправе отказать Пользователю в обмене Товара или возврате
						денежных средств по своему усмотрению, если будет иметь доказательства
						неправомерных действий со стороны Пользователя. Также Компания/Исполнитль
						вправе привлечь Пользователя к ответственности в судебном порядке.
					</p>
					<p className={`${styles['text-x']}`}>
						4.8. По вопросам, связанным с оплатой Товара и/или Доставки способами,
						предусмотренными пп. 4.1.1., 4.1.2. настоящего соглашения, Пользователь вправе
						обратиться к Исполнителю и/или к Доставщику.
					</p>
					<p className={`${styles['text-x']}`}>
						4.9. Компания оставляет за собой право в любой момент потребовать от
						Пользователя подтверждения данных, указанных им в рамках Сервиса, в том числе
						данных Привязанной карты, и запросить в связи с этим подтверждающие документы
						(в частности, документы, удостоверяющие личность), непредставление которых, по
						усмотрению Компании, может быть приравнено к предоставлению недостоверной
						информации и повлечь последствия, предусмотренные настоящим соглашением.
					</p>
					<h3 className={styles.agreement_subtitle}>
						5. Гарантии и ответственность сторон
					</h3>
					<p className={`${styles['text-x']}`}>
						5.1. Пользователь гарантирует, что не будет предпринимать каких-либо действий,
						направленных на причинение ущерба Исполнителю, Компании, операторам сотовой
						мобильной связи, правообладателям или иным лицам.
					</p>
					<p className={`${styles['text-x']}`}>
						5.2. В случае нарушения правил использования сервиса, указанных в разделе 2
						настоящего Соглашения, Пользователь обязуется возместить вред, причиненный
						такими действиями.
					</p>
					<p className={`${styles['text-x']}`}>
						5.3. Если Пользователем не доказано обратное, любые действия, совершенные с
						использованием его мобильного устройства, считаются совершенными
						соответствующим Пользователем.
					</p>
					<p className={`${styles['text-x']}`}>
						5.4. Компания не является уполномоченной организацией по смыслу Закона РФ от
						07.02.1992 г. № 2300-1 «О защите прав потребителей», и не осуществляет
						рассмотрение и удовлетворение претензий Пользователей в отношении Товара и/или
						Доставки ненадлежащего качества, Заказ которого (которых) оформлен
						Пользователем на Сервисе.При обращении Пользователя к Компании по вопросам,
						касающимся Договора, заключаемого в результате оформления Заказа, в том числе
						с претензиями относительно исполнения данного Договора, Компания вправе
						передать соответствующую информацию Исполнителю и/или Доставщику, а также
						передать Пользователю информацию, полученную от Исполнителя и/или Доставщика
						по данным вопросам.
					</p>
					<p className={`${styles['text-x']}`}>
						5.5. Пользователь при оформлении Заказа, в соответствии с условиями настоящего
						Соглашения, подтверждает личное ознакомление с ингредиентами, входящими в
						состав Заказа, которые могут быть несовместимыми с организмом Пользователя в
						силу индивидуальных особенностей, в частности, могут вызвать отторжение или
						аллергическую реакцию.
					</p>
					<p className={`${styles['text-x']}`}>
						Пользователь при наступлении указанного в настоящем пункте случая -
						индивидуальной несовместимости Продукции с организмом Пользователя,
						подтверждает, что такой случай индивидуальной несовместимости не связан с
						качеством продукции и соблюдения всех норм, хранения, транспортировки и
						приготовления Заказа, а является индивидуальной особенностью организма
						Пользователя о которой Исполнителю не могло быть известно, в связи с чем,
						Исполнитель не несет ответственности при наступлении такого случая.
					</p>
					<h3 className={styles.agreement_subtitle}>6. Сайты третьих лиц</h3>
					<p className={`${styles['text-x']}`}>
						6.1. Сервис может содержать ссылки или представлять доступ на другие сайты в
						сети Интернет (сайты третьих лиц) и размещенный на данных сайтах контент,
						являющийся результатом интеллектуальной деятельности третьих лиц и охраняемый
						в соответствии с законодательством Российской Федерации. Указанные сайты и
						размещенный на них контент не проверяются Компанией на соответствие
						требованиям законодательства Российской Федерации.
					</p>
					<p className={`${styles['text-x']}`}>
						6.2. Компания не несет ответственность за любую информацию или контент,
						размещенные на сайтах третьих лиц, к которым Пользователь получает доступ
						посредством сервиса, включая, в том числе, любые мнения или утверждения,
						выраженные на сайтах третьих лиц.
					</p>
					<p className={`${styles['text-x']}`}>
						6.3. Пользователь подтверждает, что с момента перехода Пользователя по ссылке,
						содержащейся на сервисе на сайт третьего лица, взаимоотношения Компании и
						Пользователя прекращаются, настоящее Соглашение в дальнейшем не
						распространяется на Пользователя, и Компания не несет ответственность за
						использование Пользователем контента, правомерность такого использования и
						качество контента, размещенного на сайтах третьих лиц.
					</p>
					<h3 className={styles.agreement_subtitle}>
						7. Конфиденциальность и обработка персональных данных Пользователя.
					</h3>
					<p className={`${styles['text-x']}`}>
						7.1. Персональные данные Пользователя обрабатываются в соответствии
						Федеральным законом от 27.07.2006 г. № 152-ФЗ «О персональных данных» и
						Политикой хранения и обработки персональных данных.
					</p>
					<p className={`${styles['text-x']}`}>
						7.2. При регистрации/оформлении заказа Пользователь предоставляет следующие
						данные: имя, адрес электронной почты, номер контактного телефона, адрес
						доставки заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						7.3. В целях исполнения настоящего соглашения Компания развивает, оптимизирует
						и внедряет новый функционал сервиса (включая продукты информационного,
						рекламного, развлекательного и иного характера), в т.ч. с участием
						аффилированных лиц и/или партнеров.
					</p>
					<p className={`${styles['text-x']}`}>
						Для обеспечения реализации указанных целей, а также в целях информирования
						Пользователей о своих услугах, продвижения товаров и услуг, проведения
						электронных и sms опросов, Получения Пользователем персонализированной
						(таргетированной) рекламы, контроля маркетинговых акций, клиентской поддержки,
						организации доставки товара Пользователям, проведения розыгрышей призов среди
						Пользователей, контроля удовлетворенности Пользователя и качества услуг,
						проверки, исследования и анализа таких данных Пользователь при
						регистрации/оформлении заказа соглашается и поручает Компании осуществлять с
						соблюдением применимого законодательства обработку данных, в т.ч. результатов
						автоматизированной обработки таких данных в виде целочисленных и/или текстовых
						значений и идентификаторов, их передачу аффилированным лицам и/или
						Исполнителям/Доставщикам во исполнение такого поручения на обработку, а также
						осуществлять сбор (получение) данных Пользователя и иных связанных с
						Пользователем данных от аффилированных лиц и/или Исполнителей.
					</p>
					<p className={`${styles['text-x']}`}>
						7.4. Под данными, связанными с Пользователем, понимается информация о
						технических средствах (устройствах) и способах технологического взаимодействия
						с сервисом и/или сервисами аффилированных лиц и/или партнеров (в т. ч.
						IP-адрес хоста, вид операционной системы, тип браузера, географическое
						положение, данные о провайдере и иное), об активности Пользователя, а также
						иные данные, получаемые указанными способами.
					</p>
					<p className={`${styles['text-x']}`}>
						7.5. Под обработкой данных понимается любое действие (операция) или
						совокупность действий (операций), совершаемых с использованием средств
						автоматизации или без использования таких средств с персональными данными
						Пользователя, включая сбор, запись, систематизацию, накопление, хранение,
						уточнение (обновление, изменение), сопоставление, извлечение, использование,
						передача аффилированным лицам Компании и/или Исполнителя в целях и на условиях
						настоящего Соглашения, обезличивание, блокирование, удаление, уничтожение.
					</p>
					<p className={`${styles['text-x']}`}>
						7.6. Компания имеет право отправлять Пользователю от своего имени
						самостоятельно или с привлечением технических партнеров информационные, в том
						числе сервисные и рекламные сообщения, на электронную почту Пользователя,
						мобильный телефон (смс, телефонные звонки) или через используемые им сервисы
						Компании (социальные сети, мессенджеры и иные). Пользователь вправе отказаться
						от получения рекламной и другой информации без объяснения причин отказа.
						Сервисные сообщения, информирующие Пользователя о заказе и этапах его
						обработки, отправляются автоматически и не могут быть отклонены Пользователем.
					</p>
					<p className={`${styles['text-x']}`}>
						7.7. Компания вправе использовать технологию «cookies». «Cookies» не содержат
						конфиденциальную информацию, и Компания вправе передавать информацию о
						«cookies» Исполнителям, агентам и третьим лицам, имеющим заключенные с
						Компанией договоры, для исполнения обязательств перед Пользователем и для
						целей статистики и оптимизации рекламных сообщений.
					</p>
					<p className={`${styles['text-x']}`}>
						7.8. Компания получает информацию об ip-адресе посетителя Сайта{' '}
						<a href="https://goodfood.acceleratorpracticum.ru/">
							https://goodfood.acceleratorpracticum.ru/
						</a>
						. Данная информация не используется для установления личности посетителя.
					</p>
					<p className={`${styles['text-x']}`}>
						7.9. Компания не несет ответственности за сведения, предоставленные
						Пользователем на Сайте в общедоступной форме.
					</p>
					<p className={`${styles['text-x']}`}>
						7.10. Компания вправе осуществлять записи телефонных разговоров с
						Пользователем. При этом Компания обязуется предотвращать попытки
						несанкционированного доступа к информации, полученной в ходе телефонных
						переговоров, и/или передачу ее третьим лицам, не имеющим непосредственного
						отношения к исполнению заказов в соответствие с п. 4 ст. 16 Федерального
						закона «Об информации, информационных технологиях и защите информации».
					</p>
					<h3 className={styles.agreement_subtitle}>
						8. Регистрация на Сервисе, пароль и безопасность
					</h3>
					<p className={`${styles['text-x']}`}>
						8.1. Для получения права использования Пользователем сервиса Пользователю
						рекомендуется осуществить регистрацию учетной записи Пользователя на сервисе.
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						8.2. Регистрация Пользователя осуществляется следующим образом:
					</p>
					<p className={`${styles['text-x']}`}>
						а) ввести в форму сервиса абонентский номер телефона в федеральном формате
						(89ХХХХХХХХХ), указанный Пользователем при регистрации абонентский номер
						телефона будет использоваться в качестве имени Пользователя (логин) при
						использовании сервиса;
					</p>
					<p className={`${styles['text-x']}`}>
						б) ввести пароль, который придет на указанный номер мобильного телефона в виде
						sms-сообщения. В последующем пароль может быть изменен Пользователем в личном
						кабинете своего профиля;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						в) принять лицензионное соглашение – в случае работы с Приложением;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						г) принять настоящее соглашение-оферту, согласившись с её условиями;
					</p>
					<p className={`${styles['text-x']}`}>
						д) при желании дать свое согласие на получение информации (рекламы) о
						проводимых акциях Компании в соответствии с условиями настоящего соглашения.
					</p>
					<p className={`${styles['text-x']}`}>
						8.3. Совершая действия по регистрации учетной записи Пользователя в Сервисе,
						Пользователь принимает условия настоящего Соглашения, в полном объеме и без
						каких-либо изъятий.
					</p>
					<p className={`${styles['text-x']}`}>
						8.4. Регистрация Пользователя позволяет избежать несанкционированных действий
						третьих лиц от имени Пользователя и открывает последнему доступ к
						дополнительным сервисам. Передача Пользователем логина и пароля третьим лицам
						не допускается.
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						8.5. Заказ Товара осуществляется Пользователем как через сервис, так и по
						телефону.
					</p>
					<h3 className={styles.agreement_subtitle}>
						9. Оформление и сроки выполнения заказа
					</h3>
					<p className={`${styles['text-x']}`}>
						9.1. Заказ Пользователя может быть оформлен по телефону и/или посредством
						заполнения электронной формы Заказа на Сервисе.
					</p>
					<p className={`${styles['text-x']}`}>
						9.1.1. При оформлении Заказа Пользователь сам подтверждает, что ознакомлен с
						условиями настоящего соглашения и обязуется предоставить всю информацию,
						необходимую для надлежащего оформления и исполнения Заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						9.1.2. При оформлении Заказа через Сервис Пользователь заполняет электронную
						форму Заказа и отправляет сформированный Заказ путем подтверждения Заказа в
						электронной форме.
					</p>
					<p className={`${styles['text-x']}`}>
						9.1.3. Для приема в обработку Заказа, который был оформлен Пользователем через
						Сервис Компании необходимо подтверждение Компании посредством телефонного
						звонка на контактный номер Пользователя в том, что данный Заказ получен,
						принят и передан в обработку Исполнителю. Заказ считается принятым в
						обработку, начиная с момента его подтверждения.
					</p>
					<p className={`${styles['text-x']}`}>
						9.1.4. Если Заказ, который был оформлен Пользователем через сервис Компании,
						не был подтвержден со стороны Компании Пользователю, то Пользователь должен
						самостоятельно убедиться по телефону 8(812)383-0-383 в том, что его Заказ был
						получен, принят и передан в обработку Исполнителю.
					</p>
					<p className={`${styles['text-x']}`}>
						9.2. Пользователь может заказать только те Товары, которые есть в наличии у
						Исполнителя в момент оформления Заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						9.2.1. Если у Исполнителя отсутствует необходимое количество или ассортимент
						заказанного Пользователем Товара, Компания информирует об этом Пользователя по
						телефону в течение 30 минут после получения Заказа от Пользователя.
						Пользователь вправе согласиться принять Товар в ином количестве или
						ассортименте, либо аннулировать свой Заказ. В случае неполучения ответа
						Пользователя Заказ Пользователя аннулируется в полном объеме.
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						9.3. Пользователь не имеет право изменить состав Заказа.
					</p>
					<p className={`${styles['text-x']}`}>
						9.4. В случае возникновения у Пользователя дополнительных вопросов, касающихся
						характеристик Товара, перед оформлением Заказа, Пользователь должен обратиться
						к Компании по телефону 8(812)383-0-383 для получения необходимой информации.
					</p>
					<p className={`${styles['text-x']}`}>
						9.5. Исполнитель получает информацию о Заказе Пользователя в течение 5 минут с
						момента приема Заказа Компанией. Исполнитель приступает к выполнению Заказа в
						порядке очередности всех Заказов, находящихся у него на исполнении.
					</p>
					<p className={`${styles['text-x']}`}>
						9.6. Компания при оформлении Заказа от Пользователя информирует последнего о
						планируемом времени доставки Заказа по адресу Пользователя. Если при
						оформлении Заказа Пользователь не аннулировал Заказ и данный Заказ был
						оформлен Компанией, соответственно Пользователь согласен с обозначенным ему
						временем доставки Заказа и Заказ будет передан Исполнителю для выполнения.
					</p>
					<h3 className={styles.agreement_subtitle}>10. Доставка Товара</h3>
					<p className={`${styles['text-x']}`}>
						10.1. В случае если Товар не был передан Пользователю по вине последнего,
						отказа Пользователя от приемки и/или оплаты им Товара, ложного вызова, логин
						Пользователя (абонентский номер телефона) подлежит блокированию и в дальнейшем
						Заказы от данного Пользователя по телефону и/или через сервис не принимаются.
					</p>
					<p className={`${styles['text-x']}`}>
						10.2. Доставка Товара осуществляется по фактическому адресу, указанному
						Пользователем при оформлении Заказа через сервис и/или по телефону Компании.
					</p>
					<p className={`${styles['text-x']}`}>
						10.2.1. Средний срок доставки оформленного Заказа составляет 45-60 минут.
						Данное время может быть увеличено в виду погодных условий, ситуации на дороге,
						загруженностью на кухне Исполнителя.
					</p>
					<p className={`${styles['text-x']}`}>
						10.2.2. Возможность доставки Товара за пределы зоны доставки Пользователь
						обязан предварительно согласовать с Исполнителем. Исполнитель вправе отказать
						в доставке Заказа, если он не входит в пределы зоны доставки.
					</p>
					<p className={`${styles['text-x']}`}>
						10.2.3. Компания не несет ответственности за соблюдение/несоблюдение
						Исполнителем и/или Доставщиком своих обязательств перед Пользователями, а
						также за достоверность информации, предоставленной такими службами. Компания
						со своей стороны способствует урегулированию различных ситуаций, возникающих
						между Пользователем и Исполнителем и/или Доставкой, но не гарантирует
						положительное и окончательное их решение для той, или иной Стороны.
					</p>
					<p className={`${styles['text-x']}`}>
						10.3. Доставка осуществляется при условии, что Пользователь сделает Заказ на
						сумму минимального заказа. Сумма минимального заказа определяется Исполнителем
						и в одностороннем порядке и указывается на Сервисе Компанией.
					</p>
					<h3 className={styles.agreement_subtitle}>11. Форс-мажор</h3>
					<p className={`${styles['text-x']}`}>
						11. Любая из Сторон в соответствии с настоящим соглашением, освобождается от
						ответственности за полное или частичное неисполнение своих обязательств по
						настоящему соглашению, если это неисполнение было вызвано обстоятельствами
						непреодолимой силы. Обстоятельства непреодолимой силы означают чрезвычайные
						события и обстоятельства, которые Стороны не могли ни предвидеть, ни
						предотвратить разумными средствами. Такие чрезвычайные события или
						обстоятельства включают в себя, в частности: забастовки, наводнения, пожары,
						землетрясения и иные стихийные бедствия, войны, военные действия и т.д.
					</p>
					<h3 className={styles.agreement_subtitle}>
						12. Допущения при производстве продукции, согласно технологическим картам.
					</h3>
					<p className={`${styles['text-x']}`}>
						12.1. Запеченные роллы: запекание – это процесс приготовления роллов и суши, и
						не является его температурной характеристикой;
					</p>
					<p className={`${styles['text-x']}`}>
						12.2. Роллы с крабовым мясом: допускается попадание кусочков хитина/осколков
						панциря не более 5 мм;
					</p>
					<p className={`${styles['text-x']}`}>
						12.3. Лосось: допускаются разные оттенки лосося с широкими прожилками при
						смене поставщиков на производстве;
					</p>
					<p className={`${styles['text-x']}`}>
						12.4. Темный цвет у авокадо: цвет у авокадо зависит от окисляемости продукта,
						по стандартам изготовления цвет не влияет на вкусовые ощущения;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						12.5. Мидии: допускается попадание мяса краба в блюда с мидиями и кусочков
						жемчуга;
					</p>
					<p className={`${styles['text-x']}`}>
						12.6. Неочищенный картофель: при приготовлении некоторых блюд, в том числе
						супов, используется молодой картофель в мундире;
					</p>
					<p className={`${styles['text-x']}`}>
						12.7. Мидии в сливочном соусе: допускается попадание закрытых мидий не более
						10% от общего количества;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						12.8. Французский томатный суп с морепродуктами: допускается попадание
						закрытых мидий;
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						12.9. Допускается попадание кожуры от семечек в блюдах с ростками подсолнуха;
					</p>
					<h3 className={styles.agreement_subtitle}>13. Заключительные положения</h3>
					<p className={`${styles['text-x']}`}>
						13. Настоящее Соглашение вступает в силу для Пользователя с момента
						регистрации на Сервисе и/или оформления Заказа и действует до тех пор, пока не
						будет изменено или расторгнуто по инициативе Пользователя или Компании.
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						13.1. Настоящее Соглашение составлено на русском языке.
					</p>
					<p className={`${styles['text-x']}`}>
						13.2. Если какое-либо из положений настоящего Соглашения будет признано
						недействительным, это не оказывает влияния на действительность или
						применимость остальных положений настоящего Соглашения.
					</p>
					<p className={`${styles['text-x']}`}>
						13.3. Дальнейшее использование сервиса означает, что Пользователь принял на
						себя ответственность за безусловное соблюдение настоящего Соглашения.
					</p>
					<h3 className={styles.agreement_subtitle}>14. Информация о Компании</h3>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>ООО «ГудФуд»</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>ИНН/КПП:</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>ОГРН: </p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						Телефон: 8-800-000-444-333
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						Адрес для переписки:
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						Дата публикации последней редакции Соглашения об условиях доставки 20.11.2023
						г.
					</p>
					<p className={`${styles['text-x']} ${styles['agreement_p']}`}>
						Дата вступления в силу последней редакции Соглашения об условиях доставки
						20.11.2023 г.
					</p>
				</div>
			</section>
		</>
	);
};

export default DeliveryConditions;
